app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "last_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "gladkikh"], ["updated_at", "2022-08-17 23:25:14.653915"], ["id", 14]]